УТ_11_4.Umico/src/Catalogs/UMC_ПараметрыПодключенияКUmico/UMC_ПараметрыПодключенияКUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UMC_ПараметрыПодключенияКUmico</name>
  <attributes>
    <name>APIKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользования</name>
    <type>
      <types>EnumRef.UMC_ВариантыИспользованияПодключенияКUmico</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_11_4.Umico/src/Enums/UMC_ВариантыИспользованияПодключенияКUmico/UMC_ВариантыИспользованияПодключенияКUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>UMC_ВариантыИспользованияПодключенияКUmico</name>
  <enumValues>
    <name>ДляРозничныхПродаж</name>
  </enumValues>
  <enumValues>
    <name>ДляОптовыхПродаж</name>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Catalogs/UMC_ПараметрыПодключенияКUmico/Forms/ФормаЭлемента/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();
	СформироватьПодсказкуПоНаименованию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантИспользованияПриИзменении(Элемент)
	
	УстановитьВидимость();
	СформироватьПодсказкуПоНаименованию();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	СформироватьПодсказкуПоНаименованию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	СформироватьПодсказкуПоНаименованию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если Объект.ВариантИспользования = Перечисления.UMC_ВариантыИспользованияПодключенияКUmico.ДляРозничныхПродаж Тогда
		Элементы.КассаККМ.Видимость = Истина;
		Элементы.Пользователь.Видимость = Ложь;
	Иначе
		Элементы.КассаККМ.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПодсказкуПоНаименованию()
	
	СписокВыбора = Элементы.Наименование.СписокВыбора; // Массив из Строка
	
	СписокВыбора.Очистить();
	
	Если Объект.ВариантИспользования = Перечисления.UMC_ВариантыИспользованияПодключенияКUmico.ДляРозничныхПродаж Тогда
		СписокВыбора.Добавить(Строка(Объект.КассаККМ));
	Иначе
		СписокВыбора.Добавить(Строка(Объект.Пользователь));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
